# Neovim
brew "neovim"

# Go
brew "go"
brew "gopls"
brew "gofumpt"
brew "delve"

# Python
brew "pyright"
brew "black"
brew "ruff"
brew "pyenv"

# JavaScript / TypeScript
brew "node"
brew "biome"

# Tag browser
brew "universal-ctags"

# Lazy tools
brew "lazygit"
brew "lazydocker"
brew "lazysql"

# CLI
brew "yazi"
brew "glow"

# shell
brew "zsh"

# docker
# brew "docker-compose"
brew "docker"

brew "tmux"
brew "cmux"
